// MARK: - Interpolated stuff for Voice Over
"%@" = "%@";
//"%lld items" = "%lld items";
//Project-CoreDataHelpers label for HomeView
"%@, %lld items, %g%% complete." = "%@, %lld items, %g%% complete.";
// ItemRowViewModel Labels
"%@, completed." = "%@, completed.";
"%@, high priority." = "%@, high priority.";



// MARK: - General
/* General strings for buttons etc */
"OK" = "OK";
"Delete" = "Delete";
"Cancel" = "Cancel";
/* A username and a message they posted */
"%@: %@" = "%@: %@";



// MARK: - Core Data
/* The string returned for the title when creating a new project */
"New Project" = "New Project";

/* The string returned for the title when creating a new item */
"New Item" = "New Item";



// MARK: - ContentView (Tabs)
/* The first tab, showing an overview of projects and items that are important */
"Home" = "Home";

/* The second tab, showing currently open projects */
"Open" = "Open";

/* The third tab, showing currently closed projects */
"Closed" = "Closed";

/* The fourth tab, showing community comments */
"Community" = "Community";

/* The fith tab, showing awards earned by the user */
"Awards" = "Awards";



// MARK: - HomeView
/* The text above the first three (high priority) items on the 'home' tab */
"Up next" = "Up next";

/* The text above the last seven (high priority) items on the 'home' tab */
"More to explore" = "More to explore";



// MARK: - ProjectsView
/* Title of the tab for open projects */
"Open Projects" = "Open Projects";

/* Title of the tab for closed projects */
"Closed Projects" = "Closed Projects";

/* Button that adds a new project */
"Add New Project" = "Add New Project";

/* Button that opens the edit project view */
"Edit Project" = "Edit Project";

/* Button that adds a new item */
"Add New Item" = "Add New Item";

/* Button that shows a menu with (the following) sorting options */
"Sort" = "Sort";

/* The title of the menu */
"Sort Items" = "Sort Items";

/* Sort using an optimized algorithm */
"Optimized" = "Optimized";

/* Sort by creation date */
"Creation Date" = "Creation Date";

/* Sort by title */
"Title" = "Title";

/* Shown by default when the user hasn't created any projects */
"There's nothing to see here right now." = "There's nothing to see here right now.";



// MARK: - Community
/* Title of the navigation title for shared projects*/
"Shared Projects" = "Shared Projects";

/* Header text for SharedItemsView */
"Chat about this project…" = "Chat about this project…";

/* Confirmation text for SignInView */
"You're all set!" = "You're all set!";

/* Error text for SignInView */
"Sorry, there was an error." = "Sorry, there was an error.";

/* Sign in prompt for SignInView */
"Please sign in" = "Please sign in";

/* Error text for SharedItemsView */
"There was an error" = "There was an error";

/* Send button text for SharedItemsView */
"Send" = "Send";

/* Enter message prompt text for SharedItemsView */
"Enter your message" = "Enter your message";

/* Sign in button text for SharedItemsView */
"Sign in to comment" = "Sign in to comment";

/* No results text for SharedItemsView */
"No results" = "No results";

/* SignInWithApple explanation text for SignInView */
"In order to keep our community safe, we ask that you sign in before commenting on a project.\n\nWe don't track your personal information; your name is used for display purposes only.\n\nPlease note: we reserve the right to remove messages that are inappropriate or offensive." = "In order to keep our community safe, we ask that you sign in before commenting on a project.\n\nWe don't track your personal information; your name is used for display purposes only.\n\nPlease note: we reserve the right to remove messages that are inappropriate or offensive.";



// MARK: - Cloud Errors
"There was a problem communicating with iCloud; please check your network connection and try again." = "There was a problem communicating with iCloud; please check your network connection and try again.";
"There was a problem with your iCloud account; please check that you're logged in to iCloud." = "There was a problem with your iCloud account; please check that you're logged in to iCloud.";
"You've hit iCloud's rate limit; please wait a moment then try again." = "You've hit iCloud's rate limit; please wait a moment then try again.";
"You've exceeded your iCloud quota; please clear up some space then try again." = "You've exceeded your iCloud quota; please clear up some space then try again.";



// MARK: - EditItem & EditProjectView
/* Section title for the basic settings in the EditItemView and EditProjectView */
"Basic Settings" = "Basic Settings";



// MARK: - EditItemView
/* Title for the view */
"Edit Item" = "Edit Item";

/* Default text for the item name field */
"Item name" = "Item name";

/* Default text for the item description field */
"Description" = "Description";

/* Text for the priority of the item, with the following options */
"Priority" = "Priority";
"Low" = "Low";
"Medium" = "Medium";
"High" = "High";

/* Text for the button to mark an item completed */
"Mark Completed" = "Mark Completed";



// MARK: - EditProjectView
/* Title for the view */
"Edit Project" = "Edit Project";

/* Default text for the project name field */
"Project name" = "Project name";

/* Default text for the project description field */
"Description of this project" = "Description of this project";

/* Title for the section for the project color, with the following colors */
"Custom project color" = "Custom project color";
"Select a project color" = "Select a project color";
"Pink" = "Pink";
"Purple" = "Purple";
"Red" = "Red";
"Orange" = "Orange";
"Gold" = "Gold";
"Green" = "Green";
"Teal" = "Teal";
"Light Blue" = "Light Blue";
"Dark Blue" = "Dark Blue";
"Midnight" = "Midnight";
"Dark Gray" = "Dark Gray";
"Gray" = "Gray";

/* Button that closes the project */
"Close this project" = "Close this project";

/* Button to reopen the project */
"Reopen this project" = "Reopen this project";

/* Button to delete the project */
"Delete this project" = "Delete this project";

/* Info text about closing and deleting a project */
"Closing a project moves it from the Open to Closed tab; deleting it removes the project completely." = "Closing a project moves it from the Open to Closed tab; deleting it removes the project completely.";

/* Warning text when deleting a project */
"Are you sure you want to delete this project? You will also delete all the items it contains." = "Are you sure you want to delete this project? You will also delete all the items it contains.";

/* Button for the confirmation of deleting a project */
"Delete project?" = "Delete project?";



// MARK: - AwardsView
/* Text for when the user taps a not yet unlocked award */
"Locked" = "Locked";

/* Text for when the user taps an unlocked award */
"Unlocked: %@" = "Unlocked: %@";



// MARK: - SelectSomethingView
/* Shown by default when the user hasn't select a project or item */
"Please select something from the menu to begin." = "Please select something from the menu to begin.";



// MARK: - Notifications
"Project reminders" = "Project reminders";
"Show reminders" = "Show reminders";
"Oops!" = "Oops!";
"There was a problem. Please check you have notifications enabled." = "There was a problem. Please check you have notifications enabled.";
"Check Settings" = "Check Settings";
"Reminder time" = "Reminder time";



// MARK: - Unlocking premium
"Get Unlimited Projects" = "Get Unlimited Projects";
"You can add three projects for free, or pay %@ to add unlimited projects." = "You can add three projects for free, or pay %@ to add unlimited projects.";
"If you already bought the unlock on another device, press Restore Purchases." = "If you already bought the unlock on another device, press Restore Purchases.";
"Restore Purchases" = "Restore Purchases";
"Sorry, there was an error loading the store. Please try again later." = "Sorry, there was an error loading the store. Please try again later.";
"Buy: %@" = "Buy: %@";
"Loading…" = "Loading…";
"Thank you!" = "Thank you!";
"Thank you! Your request is pending approval, but you can carry on using the app in the meantime." = "Thank you! Your request is pending approval, but you can carry on using the app in the meantime.";
"Dismiss" = "Dismiss";



// MARK: - Widgets
"Up next…" = "Up next…";
"Nothing!" = "Nothing!";
"Your #1 top-priority item." = "Your #1 top-priority item.";
"Your most important items." = "Your most important items.";
